SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cordic.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 CORDIC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_CORDIC_H
#define EFR32FG25_CORDIC_H
#define CORDIC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_CORDIC CORDIC
 * @{
 * @brief EFR32FG25 CORDIC Register Declaration.
 *****************************************************************************/

/** CORDIC Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version ID                                      */
  __IOM uint32_t EN;                            /**< Module Enable                                      */
  __IOM uint32_t SWRST;                         /**< Software Reset                                     */
  __IOM uint32_t CONNECT;                       /**< New Register                                       */
  __IOM uint32_t DISCLK;                        /**< Disable clk_per                                    */
  uint32_t       RESERVED0[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN;                        /**< New Register                                       */
  uint32_t       RESERVED1[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT;                       /**< New Register                                       */
  uint32_t       RESERVED2[23U];                /**< Reserved for future use                            */
  uint32_t       RESERVED3[1U];                 /**< Reserved for future use                            */
  uint32_t       RESERVED4[7U];                 /**< Reserved for future use                            */
  uint32_t       RESERVED5[1U];                 /**< Reserved for future use                            */
  uint32_t       RESERVED6[79U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL;                          /**< New Register                                       */
  __IOM uint32_t UNWRAP;                        /**< New Register                                       */
  uint32_t       RESERVED7[894U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_SET;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_SET;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_SET;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_SET;                    /**< Disable clk_per                                    */
  uint32_t       RESERVED8[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_SET;                    /**< New Register                                       */
  uint32_t       RESERVED9[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_SET;                   /**< New Register                                       */
  uint32_t       RESERVED10[23U];               /**< Reserved for future use                            */
  uint32_t       RESERVED11[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED12[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED13[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED14[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_SET;                      /**< New Register                                       */
  __IOM uint32_t UNWRAP_SET;                    /**< New Register                                       */
  uint32_t       RESERVED15[894U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_CLR;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_CLR;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_CLR;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_CLR;                    /**< Disable clk_per                                    */
  uint32_t       RESERVED16[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED17[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_CLR;                   /**< New Register                                       */
  uint32_t       RESERVED18[23U];               /**< Reserved for future use                            */
  uint32_t       RESERVED19[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED20[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED21[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED22[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_CLR;                      /**< New Register                                       */
  __IOM uint32_t UNWRAP_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED23[894U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_TGL;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_TGL;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_TGL;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_TGL;                    /**< Disable clk_per                                    */
  uint32_t       RESERVED24[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED25[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_TGL;                   /**< New Register                                       */
  uint32_t       RESERVED26[23U];               /**< Reserved for future use                            */
  uint32_t       RESERVED27[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED28[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED29[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED30[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_TGL;                      /**< New Register                                       */
  __IOM uint32_t UNWRAP_TGL;                    /**< New Register                                       */
} CORDIC_TypeDef;
/** @} End of group EFR32FG25_CORDIC */

/**************************************************************************//**
 * @addtogroup EFR32FG25_CORDIC
 * @{
 * @defgroup EFR32FG25_CORDIC_BitFields CORDIC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for CORDIC IPVERSION */
#define _CORDIC_IPVERSION_RESETVALUE           0x00000001UL                               /**< Default value for CORDIC_IPVERSION          */
#define _CORDIC_IPVERSION_MASK                 0xFFFFFFFFUL                               /**< Mask for CORDIC_IPVERSION                   */
#define _CORDIC_IPVERSION_IPVERSION_SHIFT      0                                          /**< Shift value for CORDIC_IPVERSION            */
#define _CORDIC_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                               /**< Bit mask for CORDIC_IPVERSION               */
#define _CORDIC_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                               /**< Mode DEFAULT for CORDIC_IPVERSION           */
#define CORDIC_IPVERSION_IPVERSION_DEFAULT     (_CORDIC_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for CORDIC_IPVERSION   */

/* Bit fields for CORDIC EN */
#define _CORDIC_EN_RESETVALUE                  0x00000000UL                             /**< Default value for CORDIC_EN                 */
#define _CORDIC_EN_MASK                        0x00000003UL                             /**< Mask for CORDIC_EN                          */
#define CORDIC_EN_EN                           (0x1UL << 0)                             /**< Module Enable                               */
#define _CORDIC_EN_EN_SHIFT                    0                                        /**< Shift value for CORDIC_EN                   */
#define _CORDIC_EN_EN_MASK                     0x1UL                                    /**< Bit mask for CORDIC_EN                      */
#define _CORDIC_EN_EN_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for CORDIC_EN                  */
#define CORDIC_EN_EN_DEFAULT                   (_CORDIC_EN_EN_DEFAULT << 0)             /**< Shifted mode DEFAULT for CORDIC_EN          */
#define CORDIC_EN_DISABLING                    (0x1UL << 1)                             /**< Disablement Busy Status                     */
#define _CORDIC_EN_DISABLING_SHIFT             1                                        /**< Shift value for CORDIC_DISABLING            */
#define _CORDIC_EN_DISABLING_MASK              0x2UL                                    /**< Bit mask for CORDIC_DISABLING               */
#define _CORDIC_EN_DISABLING_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for CORDIC_EN                  */
#define CORDIC_EN_DISABLING_DEFAULT            (_CORDIC_EN_DISABLING_DEFAULT << 1)      /**< Shifted mode DEFAULT for CORDIC_EN          */

/* Bit fields for CORDIC SWRST */
#define _CORDIC_SWRST_RESETVALUE               0x00000000UL                             /**< Default value for CORDIC_SWRST              */
#define _CORDIC_SWRST_MASK                     0x00000003UL                             /**< Mask for CORDIC_SWRST                       */
#define CORDIC_SWRST_SWRST                     (0x1UL << 0)                             /**< Software Reset Command                      */
#define _CORDIC_SWRST_SWRST_SHIFT              0                                        /**< Shift value for CORDIC_SWRST                */
#define _CORDIC_SWRST_SWRST_MASK               0x1UL                                    /**< Bit mask for CORDIC_SWRST                   */
#define _CORDIC_SWRST_SWRST_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for CORDIC_SWRST               */
#define CORDIC_SWRST_SWRST_DEFAULT             (_CORDIC_SWRST_SWRST_DEFAULT << 0)       /**< Shifted mode DEFAULT for CORDIC_SWRST       */
#define CORDIC_SWRST_RESETTING                 (0x1UL << 1)                             /**< Software Reset Busy Status                  */
#define _CORDIC_SWRST_RESETTING_SHIFT          1                                        /**< Shift value for CORDIC_RESETTING            */
#define _CORDIC_SWRST_RESETTING_MASK           0x2UL                                    /**< Bit mask for CORDIC_RESETTING               */
#define _CORDIC_SWRST_RESETTING_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for CORDIC_SWRST               */
#define CORDIC_SWRST_RESETTING_DEFAULT         (_CORDIC_SWRST_RESETTING_DEFAULT << 1)   /**< Shifted mode DEFAULT for CORDIC_SWRST       */

/* Bit fields for CORDIC CONNECT */
#define _CORDIC_CONNECT_RESETVALUE             0x00000000UL                             /**< Default value for CORDIC_CONNECT            */
#define _CORDIC_CONNECT_MASK                   0x00000101UL                             /**< Mask for CORDIC_CONNECT                     */
#define CORDIC_CONNECT_IN                      (0x1UL << 0)                             /**< Input FIFO connect                          */
#define _CORDIC_CONNECT_IN_SHIFT               0                                        /**< Shift value for CORDIC_IN                   */
#define _CORDIC_CONNECT_IN_MASK                0x1UL                                    /**< Bit mask for CORDIC_IN                      */
#define _CORDIC_CONNECT_IN_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORDIC_CONNECT             */
#define CORDIC_CONNECT_IN_DEFAULT              (_CORDIC_CONNECT_IN_DEFAULT << 0)        /**< Shifted mode DEFAULT for CORDIC_CONNECT     */
#define CORDIC_CONNECT_OUT                     (0x1UL << 8)                             /**< Output FIFO connect                         */
#define _CORDIC_CONNECT_OUT_SHIFT              8                                        /**< Shift value for CORDIC_OUT                  */
#define _CORDIC_CONNECT_OUT_MASK               0x100UL                                  /**< Bit mask for CORDIC_OUT                     */
#define _CORDIC_CONNECT_OUT_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for CORDIC_CONNECT             */
#define CORDIC_CONNECT_OUT_DEFAULT             (_CORDIC_CONNECT_OUT_DEFAULT << 8)       /**< Shifted mode DEFAULT for CORDIC_CONNECT     */

/* Bit fields for CORDIC DISCLK */
#define _CORDIC_DISCLK_RESETVALUE              0x00000002UL                             /**< Default value for CORDIC_DISCLK             */
#define _CORDIC_DISCLK_MASK                    0x00000003UL                             /**< Mask for CORDIC_DISCLK                      */
#define _CORDIC_DISCLK_DISCLK_SHIFT            0                                        /**< Shift value for CORDIC_DISCLK               */
#define _CORDIC_DISCLK_DISCLK_MASK             0x3UL                                    /**< Bit mask for CORDIC_DISCLK                  */
#define _CORDIC_DISCLK_DISCLK_DEFAULT          0x00000002UL                             /**< Mode DEFAULT for CORDIC_DISCLK              */
#define _CORDIC_DISCLK_DISCLK_NONE             0x00000000UL                             /**< Mode NONE for CORDIC_DISCLK                 */
#define _CORDIC_DISCLK_DISCLK_ALL              0x00000001UL                             /**< Mode ALL for CORDIC_DISCLK                  */
#define _CORDIC_DISCLK_DISCLK_AUTO             0x00000002UL                             /**< Mode AUTO for CORDIC_DISCLK                 */
#define CORDIC_DISCLK_DISCLK_DEFAULT           (_CORDIC_DISCLK_DISCLK_DEFAULT << 0)     /**< Shifted mode DEFAULT for CORDIC_DISCLK      */
#define CORDIC_DISCLK_DISCLK_NONE              (_CORDIC_DISCLK_DISCLK_NONE << 0)        /**< Shifted mode NONE for CORDIC_DISCLK         */
#define CORDIC_DISCLK_DISCLK_ALL               (_CORDIC_DISCLK_DISCLK_ALL << 0)         /**< Shifted mode ALL for CORDIC_DISCLK          */
#define CORDIC_DISCLK_DISCLK_AUTO              (_CORDIC_DISCLK_DISCLK_AUTO << 0)        /**< Shifted mode AUTO for CORDIC_DISCLK         */

/* Bit fields for CORDIC FIFOIN */
#define _CORDIC_FIFOIN_RESETVALUE              0x00000000UL                             /**< Default value for CORDIC_FIFOIN             */
#define _CORDIC_FIFOIN_MASK                    0x1FFF3F0FUL                             /**< Mask for CORDIC_FIFOIN                      */
#define _CORDIC_FIFOIN_FID_SHIFT               0                                        /**< Shift value for CORDIC_FID                  */
#define _CORDIC_FIFOIN_FID_MASK                0xFUL                                    /**< Bit mask for CORDIC_FID                     */
#define _CORDIC_FIFOIN_FID_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORDIC_FIFOIN              */
#define CORDIC_FIFOIN_FID_DEFAULT              (_CORDIC_FIFOIN_FID_DEFAULT << 0)        /**< Shifted mode DEFAULT for CORDIC_FIFOIN      */
#define _CORDIC_FIFOIN_CID_SHIFT               8                                        /**< Shift value for CORDIC_CID                  */
#define _CORDIC_FIFOIN_CID_MASK                0x3F00UL                                 /**< Bit mask for CORDIC_CID                     */
#define _CORDIC_FIFOIN_CID_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORDIC_FIFOIN              */
#define CORDIC_FIFOIN_CID_DEFAULT              (_CORDIC_FIFOIN_CID_DEFAULT << 8)        /**< Shifted mode DEFAULT for CORDIC_FIFOIN      */
#define _CORDIC_FIFOIN_REM_SHIFT               16                                       /**< Shift value for CORDIC_REM                  */
#define _CORDIC_FIFOIN_REM_MASK                0xFF0000UL                               /**< Bit mask for CORDIC_REM                     */
#define _CORDIC_FIFOIN_REM_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORDIC_FIFOIN              */
#define CORDIC_FIFOIN_REM_DEFAULT              (_CORDIC_FIFOIN_REM_DEFAULT << 16)       /**< Shifted mode DEFAULT for CORDIC_FIFOIN      */
#define _CORDIC_FIFOIN_ALARM_SHIFT             24                                       /**< Shift value for CORDIC_ALARM                */
#define _CORDIC_FIFOIN_ALARM_MASK              0x1F000000UL                             /**< Bit mask for CORDIC_ALARM                   */
#define _CORDIC_FIFOIN_ALARM_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for CORDIC_FIFOIN              */
#define CORDIC_FIFOIN_ALARM_DEFAULT            (_CORDIC_FIFOIN_ALARM_DEFAULT << 24)     /**< Shifted mode DEFAULT for CORDIC_FIFOIN      */

/* Bit fields for CORDIC FIFOOUT */
#define _CORDIC_FIFOOUT_RESETVALUE             0x00000000UL                             /**< Default value for CORDIC_FIFOOUT            */
#define _CORDIC_FIFOOUT_MASK                   0x1FFF0000UL                             /**< Mask for CORDIC_FIFOOUT                     */
#define _CORDIC_FIFOOUT_CNT_SHIFT              16                                       /**< Shift value for CORDIC_CNT                  */
#define _CORDIC_FIFOOUT_CNT_MASK               0xFF0000UL                               /**< Bit mask for CORDIC_CNT                     */
#define _CORDIC_FIFOOUT_CNT_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for CORDIC_FIFOOUT             */
#define CORDIC_FIFOOUT_CNT_DEFAULT             (_CORDIC_FIFOOUT_CNT_DEFAULT << 16)      /**< Shifted mode DEFAULT for CORDIC_FIFOOUT     */
#define _CORDIC_FIFOOUT_ALARM_SHIFT            24                                       /**< Shift value for CORDIC_ALARM                */
#define _CORDIC_FIFOOUT_ALARM_MASK             0x1F000000UL                             /**< Bit mask for CORDIC_ALARM                   */
#define _CORDIC_FIFOOUT_ALARM_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for CORDIC_FIFOOUT             */
#define CORDIC_FIFOOUT_ALARM_DEFAULT           (_CORDIC_FIFOOUT_ALARM_DEFAULT << 24)    /**< Shifted mode DEFAULT for CORDIC_FIFOOUT     */

