SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cordic.h
/* Bit fields for CORDIC CTRL */
#define _CORDIC_CTRL_RESETVALUE                0x00000028UL                             /**< Default value for CORDIC_CTRL               */
#define _CORDIC_CTRL_MASK                      0x0000007FUL                             /**< Mask for CORDIC_CTRL                        */
#define _CORDIC_CTRL_MODE_SHIFT                0                                        /**< Shift value for CORDIC_MODE                 */
#define _CORDIC_CTRL_MODE_MASK                 0x3UL                                    /**< Bit mask for CORDIC_MODE                    */
#define _CORDIC_CTRL_MODE_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for CORDIC_CTRL                */
#define _CORDIC_CTRL_MODE_C2P                  0x00000000UL                             /**< Mode C2P for CORDIC_CTRL                    */
#define _CORDIC_CTRL_MODE_P2C                  0x00000001UL                             /**< Mode P2C for CORDIC_CTRL                    */
#define _CORDIC_CTRL_MODE_I2ME                 0x00000002UL                             /**< Mode I2ME for CORDIC_CTRL                   */
#define _CORDIC_CTRL_MODE_NOTUSED              0x00000003UL                             /**< Mode NOTUSED for CORDIC_CTRL                */
#define CORDIC_CTRL_MODE_DEFAULT               (_CORDIC_CTRL_MODE_DEFAULT << 0)         /**< Shifted mode DEFAULT for CORDIC_CTRL        */
#define CORDIC_CTRL_MODE_C2P                   (_CORDIC_CTRL_MODE_C2P << 0)             /**< Shifted mode C2P for CORDIC_CTRL            */
#define CORDIC_CTRL_MODE_P2C                   (_CORDIC_CTRL_MODE_P2C << 0)             /**< Shifted mode P2C for CORDIC_CTRL            */
#define CORDIC_CTRL_MODE_I2ME                  (_CORDIC_CTRL_MODE_I2ME << 0)            /**< Shifted mode I2ME for CORDIC_CTRL           */
#define CORDIC_CTRL_MODE_NOTUSED               (_CORDIC_CTRL_MODE_NOTUSED << 0)         /**< Shifted mode NOTUSED for CORDIC_CTRL        */
#define _CORDIC_CTRL_NITER_SHIFT               2                                        /**< Shift value for CORDIC_NITER                */
#define _CORDIC_CTRL_NITER_MASK                0x3CUL                                   /**< Bit mask for CORDIC_NITER                   */
#define _CORDIC_CTRL_NITER_DEFAULT             0x0000000AUL                             /**< Mode DEFAULT for CORDIC_CTRL                */
#define CORDIC_CTRL_NITER_DEFAULT              (_CORDIC_CTRL_NITER_DEFAULT << 2)        /**< Shifted mode DEFAULT for CORDIC_CTRL        */
#define CORDIC_CTRL_INTYPE                     (0x1UL << 6)                             /**< New BitField                                */
#define _CORDIC_CTRL_INTYPE_SHIFT              6                                        /**< Shift value for CORDIC_INTYPE               */
#define _CORDIC_CTRL_INTYPE_MASK               0x40UL                                   /**< Bit mask for CORDIC_INTYPE                  */
#define _CORDIC_CTRL_INTYPE_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for CORDIC_CTRL                */
#define _CORDIC_CTRL_INTYPE_UNSIGNED           0x00000000UL                             /**< Mode UNSIGNED for CORDIC_CTRL               */
#define _CORDIC_CTRL_INTYPE_SIGNED             0x00000001UL                             /**< Mode SIGNED for CORDIC_CTRL                 */
#define CORDIC_CTRL_INTYPE_DEFAULT             (_CORDIC_CTRL_INTYPE_DEFAULT << 6)       /**< Shifted mode DEFAULT for CORDIC_CTRL        */
#define CORDIC_CTRL_INTYPE_UNSIGNED            (_CORDIC_CTRL_INTYPE_UNSIGNED << 6)      /**< Shifted mode UNSIGNED for CORDIC_CTRL       */
#define CORDIC_CTRL_INTYPE_SIGNED              (_CORDIC_CTRL_INTYPE_SIGNED << 6)        /**< Shifted mode SIGNED for CORDIC_CTRL         */

/* Bit fields for CORDIC UNWRAP */
#define _CORDIC_UNWRAP_RESETVALUE              0x00000000UL                               /**< Default value for CORDIC_UNWRAP             */
#define _CORDIC_UNWRAP_MASK                    0x000FFF8FUL                               /**< Mask for CORDIC_UNWRAP                      */
#define CORDIC_UNWRAP_ENAB                     (0x1UL << 0)                               /**< Phase Unwrap Enable                         */
#define _CORDIC_UNWRAP_ENAB_SHIFT              0                                          /**< Shift value for CORDIC_ENAB                 */
#define _CORDIC_UNWRAP_ENAB_MASK               0x1UL                                      /**< Bit mask for CORDIC_ENAB                    */
#define _CORDIC_UNWRAP_ENAB_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for CORDIC_UNWRAP              */
#define _CORDIC_UNWRAP_ENAB_DISABLE            0x00000000UL                               /**< Mode DISABLE for CORDIC_UNWRAP              */
#define _CORDIC_UNWRAP_ENAB_ENABLE             0x00000001UL                               /**< Mode ENABLE for CORDIC_UNWRAP               */
#define CORDIC_UNWRAP_ENAB_DEFAULT             (_CORDIC_UNWRAP_ENAB_DEFAULT << 0)         /**< Shifted mode DEFAULT for CORDIC_UNWRAP      */
#define CORDIC_UNWRAP_ENAB_DISABLE             (_CORDIC_UNWRAP_ENAB_DISABLE << 0)         /**< Shifted mode DISABLE for CORDIC_UNWRAP      */
#define CORDIC_UNWRAP_ENAB_ENABLE              (_CORDIC_UNWRAP_ENAB_ENABLE << 0)          /**< Shifted mode ENABLE for CORDIC_UNWRAP       */
#define CORDIC_UNWRAP_MODE                     (0x1UL << 1)                               /**< Phase Unwrap Mode                           */
#define _CORDIC_UNWRAP_MODE_SHIFT              1                                          /**< Shift value for CORDIC_MODE                 */
#define _CORDIC_UNWRAP_MODE_MASK               0x2UL                                      /**< Bit mask for CORDIC_MODE                    */
#define _CORDIC_UNWRAP_MODE_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for CORDIC_UNWRAP              */
#define _CORDIC_UNWRAP_MODE_MODE0              0x00000000UL                               /**< Mode MODE0 for CORDIC_UNWRAP                */
#define _CORDIC_UNWRAP_MODE_MODE1              0x00000001UL                               /**< Mode MODE1 for CORDIC_UNWRAP                */
#define CORDIC_UNWRAP_MODE_DEFAULT             (_CORDIC_UNWRAP_MODE_DEFAULT << 1)         /**< Shifted mode DEFAULT for CORDIC_UNWRAP      */
#define CORDIC_UNWRAP_MODE_MODE0               (_CORDIC_UNWRAP_MODE_MODE0 << 1)           /**< Shifted mode MODE0 for CORDIC_UNWRAP        */
#define CORDIC_UNWRAP_MODE_MODE1               (_CORDIC_UNWRAP_MODE_MODE1 << 1)           /**< Shifted mode MODE1 for CORDIC_UNWRAP        */
#define CORDIC_UNWRAP_DIFFDIS                  (0x1UL << 2)                               /**< Phase Unwrap Diff Disable                   */
#define _CORDIC_UNWRAP_DIFFDIS_SHIFT           2                                          /**< Shift value for CORDIC_DIFFDIS              */
#define _CORDIC_UNWRAP_DIFFDIS_MASK            0x4UL                                      /**< Bit mask for CORDIC_DIFFDIS                 */
#define _CORDIC_UNWRAP_DIFFDIS_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for CORDIC_UNWRAP              */
#define _CORDIC_UNWRAP_DIFFDIS_ENABLED         0x00000000UL                               /**< Mode ENABLED for CORDIC_UNWRAP              */
#define _CORDIC_UNWRAP_DIFFDIS_DISABLED        0x00000001UL                               /**< Mode DISABLED for CORDIC_UNWRAP             */
#define CORDIC_UNWRAP_DIFFDIS_DEFAULT          (_CORDIC_UNWRAP_DIFFDIS_DEFAULT << 2)      /**< Shifted mode DEFAULT for CORDIC_UNWRAP      */
#define CORDIC_UNWRAP_DIFFDIS_ENABLED          (_CORDIC_UNWRAP_DIFFDIS_ENABLED << 2)      /**< Shifted mode ENABLED for CORDIC_UNWRAP      */
#define CORDIC_UNWRAP_DIFFDIS_DISABLED         (_CORDIC_UNWRAP_DIFFDIS_DISABLED << 2)     /**< Shifted mode DISABLED for CORDIC_UNWRAP     */
#define CORDIC_UNWRAP_SATDIS                   (0x1UL << 3)                               /**< Phase Unwrap Saturate Disable               */
#define _CORDIC_UNWRAP_SATDIS_SHIFT            3                                          /**< Shift value for CORDIC_SATDIS               */
#define _CORDIC_UNWRAP_SATDIS_MASK             0x8UL                                      /**< Bit mask for CORDIC_SATDIS                  */
#define _CORDIC_UNWRAP_SATDIS_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for CORDIC_UNWRAP              */
#define _CORDIC_UNWRAP_SATDIS_SATURATE         0x00000000UL                               /**< Mode SATURATE for CORDIC_UNWRAP             */
#define _CORDIC_UNWRAP_SATDIS_WRAP             0x00000001UL                               /**< Mode WRAP for CORDIC_UNWRAP                 */
#define CORDIC_UNWRAP_SATDIS_DEFAULT           (_CORDIC_UNWRAP_SATDIS_DEFAULT << 3)       /**< Shifted mode DEFAULT for CORDIC_UNWRAP      */
#define CORDIC_UNWRAP_SATDIS_SATURATE          (_CORDIC_UNWRAP_SATDIS_SATURATE << 3)      /**< Shifted mode SATURATE for CORDIC_UNWRAP     */
#define CORDIC_UNWRAP_SATDIS_WRAP              (_CORDIC_UNWRAP_SATDIS_WRAP << 3)          /**< Shifted mode WRAP for CORDIC_UNWRAP         */
#define CORDIC_UNWRAP_CORDICBYP                (0x1UL << 7)                               /**< Cordic Bypass                               */
#define _CORDIC_UNWRAP_CORDICBYP_SHIFT         7                                          /**< Shift value for CORDIC_CORDICBYP            */
#define _CORDIC_UNWRAP_CORDICBYP_MASK          0x80UL                                     /**< Bit mask for CORDIC_CORDICBYP               */
#define _CORDIC_UNWRAP_CORDICBYP_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for CORDIC_UNWRAP              */
#define _CORDIC_UNWRAP_CORDICBYP_NOT_BYPASS    0x00000000UL                               /**< Mode NOT_BYPASS for CORDIC_UNWRAP           */
#define _CORDIC_UNWRAP_CORDICBYP_BYPASS        0x00000001UL                               /**< Mode BYPASS for CORDIC_UNWRAP               */
#define CORDIC_UNWRAP_CORDICBYP_DEFAULT        (_CORDIC_UNWRAP_CORDICBYP_DEFAULT << 7)    /**< Shifted mode DEFAULT for CORDIC_UNWRAP      */
#define CORDIC_UNWRAP_CORDICBYP_NOT_BYPASS     (_CORDIC_UNWRAP_CORDICBYP_NOT_BYPASS << 7) /**< Shifted mode NOT_BYPASS for CORDIC_UNWRAP   */
#define CORDIC_UNWRAP_CORDICBYP_BYPASS         (_CORDIC_UNWRAP_CORDICBYP_BYPASS << 7)     /**< Shifted mode BYPASS for CORDIC_UNWRAP       */
#define _CORDIC_UNWRAP_OSR_SHIFT               8                                          /**< Shift value for CORDIC_OSR                  */
#define _CORDIC_UNWRAP_OSR_MASK                0xFF00UL                                   /**< Bit mask for CORDIC_OSR                     */
#define _CORDIC_UNWRAP_OSR_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for CORDIC_UNWRAP              */
#define CORDIC_UNWRAP_OSR_DEFAULT              (_CORDIC_UNWRAP_OSR_DEFAULT << 8)          /**< Shifted mode DEFAULT for CORDIC_UNWRAP      */
#define _CORDIC_UNWRAP_NBSHIFT_SHIFT           16                                         /**< Shift value for CORDIC_NBSHIFT              */
#define _CORDIC_UNWRAP_NBSHIFT_MASK            0xF0000UL                                  /**< Bit mask for CORDIC_NBSHIFT                 */
#define _CORDIC_UNWRAP_NBSHIFT_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for CORDIC_UNWRAP              */
#define CORDIC_UNWRAP_NBSHIFT_DEFAULT          (_CORDIC_UNWRAP_NBSHIFT_DEFAULT << 16)     /**< Shifted mode DEFAULT for CORDIC_UNWRAP      */

/** @} End of group EFR32FG25_CORDIC_BitFields */
/** @} End of group EFR32FG25_CORDIC */
/** @} End of group Parts */

#endif /* EFR32FG25_CORDIC_H */
